config.el
(setq user-full-name "Pijus Petkevičius"
      user-mail-address "pijus.petkevicius314@gmail.com")

(setq doom-font (font-spec :family "Fira Code" :size 14 :weight 'light)
      doom-symbol-font (font-spec :family "Symbola" :size 22 :weight 'Regular))


;;(setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

(setq doom-theme 'kanagawa-wave)
(custom-theme-set-faces! 'kanagawa-wave
  '(line-number :foreground "dim gray")
  '(line-number-current-line :foreground "white")
  '(mode-line-inactive :background "dim gray" :foreground "white" :height 80)
  '(mode-line :background "#16161D" :height 80)
  '(default :background "#1F1F28")
  '(diff-hl-change :foreground "#A86E51")
  )

;; Magit blame colors
(custom-set-faces
  '(magit-blame-name ((t (:background "#363646" :weight bold))))
  '(magit-blame-summary ((t (:background "#363646" :weight bold))))
  '(magit-blame-heading ((t (:background "#363646" :weight bold))))
  '(magit-blame-hash ((t (:background "#363646" :weight bold))))
  '(magit-blame-date ((t (:background "#363646" :weight bold))))
  )

;; Do not extend emacs src block begin and end
(add-hook 'org-mode-hook
          (lambda ()
            (custom-set-faces
             '(org-block-begin-line ((t (:extend nil))))
             '(org-block-end-line ((t (:extend nil)))))))

;; Add custom image to emacs home screen
;; note- if you comment this line, the logo will appear on start screen, but opening new buffer, window, etc. will show doom logo
(setq fancy-splash-image "~/.config/doom/splash/kanagawa.png")

(setq org-directory "~/Desktop/Org_mode/")

;; relative line numbers(like in vim)
(setq display-line-numbers-type 'relative)

;; linux (works for mx master 3 and M705)
(global-set-key (kbd "<mouse-6>") (lambda () (interactive) (scroll-right 6)))
(global-set-key (kbd "<mouse-7>") (lambda () (interactive) (scroll-left 6)))

;; for MX master 3 mouse (mac)
(global-set-key (kbd "<wheel-right>") (lambda () (interactive) (scroll-left 6)))
(global-set-key (kbd "<wheel-left>") (lambda () (interactive) (scroll-right 6)))

(setq mouse-wheel-tilt-scroll t)

(setq scroll-step 1)
(setq scroll-conservatively 10000)
(setq auto-window-vscroll nil)

(plist-put! +ligatures-extra-symbols
            ;; org
            :name          "»"
            :src_block     "»"
            :src_block_end "«"
            :quote         "“"
            :quote_end     "”"
            ;; Functional
            :lambda        "λ"
            :def           "ƒ"
            :composition   "∘"
            :map           "↦"
            ;; Types
            :null          "∅"
            :true          "⊤"
            :false         "⊥"
            :int           "ℤ"
            :float         "ℝ"
            :str           "S"
            :bool          "𝔹"
            :list          "L"
            ;; Flow
            :not           "￢"
            :in            "∈"
            :not-in        "∉"
            :and           "∧"
            :or            "∨"
            :for           "∀"
            :some          "∃"
            :return        "⟼"
            :yield         "⟻"
            ;; Other
            :union         "⋃"
            :intersect     "∩"
            :diff          "∖"
            :tuple         "⨂"
            :pipe          "" ;; FIXME: find a non-private char
            :dot           "•")  ;; you could also add your own if you want

(set-ligatures! '(kotlin-mode java-mode)
  :null "null"
  :and  "&&"
  :or  "||"
  :not "!"
  )
(set-ligatures! '(c-mode c++-mode)
  :null "NULL"
  :and  "&&"
  :or  "||"
  :not "!"
  )

(setq lsp-inlay-hints-mode t)
(setq lsp-inlay-hint-enable t)

(setq lsp-modeline-code-actions-enable t)
(setq lsp-ui-sideline-enable nil)
(setq lsp-ui-sideline-show-hover nil)
(setq company-idle-delay 0.1)
(setq company-meghanada-prefix-length 3)

(use-package rustic
  :config
  (setq rustic-format-on-save t))

(setq lsp-rust-server 'rust-analyzer)

(use-package lsp-mode
  :commands lsp
  :custom
  (lsp-auto-guess-root t)
  (lsp-keymap-prefix "M-m l")
  (lsp-modeline-diagnostics-enable nil)
  (lsp-keep-workspace-alive nil)
  (lsp-before-save-edits nil)
  (lsp-eldoc-enable-hover nil)
  (lsp-diagnostics-provider :flycheck)
  (lsp-completion-provider :none)
  (lsp-file-watch-threshold 1500)
  (lsp-enable-links)
  :custom-face
  :hook
  (lsp-mode . lsp-enable-which-key-integration))

(use-package general
  :config
  (general-define-key
   :prefix "SPC"
   :states '(normal visual motion)
   :keymaps 'rust-mode-map
   "m r r" 'lsp-rust-analyzer-run
   "m r t" 'lsp-rust-analyzer-related-tests
   "m d" 'lsp-rust-analyzer-debug))

(use-package omnisharp
  :after company
  :init
  (add-to-list 'company-backends 'company-omnisharp)
  (add-hook 'csharp-mode-hook 'my-csharp-mode-setup)
  :config
  (defun my-csharp-mode-setup ()
     (omnisharp-mode)
     (company-mode)
     (flycheck-mode)
     (setq c-indent-level 4)
     (setq c-basic-offset 4)
     (setq tab-width 4)
     (setq evil-shift-width 4)
     (setq indent-tabs-mode nil)
     (setq c-syntactic-indentation t)
     (setq truncate-lines t)
     ;; Customizing indentation for K&R style in C#
     (setq c-offsets-alist
           '((statement-cont . 4)         ;; Continuation line indentation
             (substatement-open . 0)      ;; No extra indent for { after control statements
             (inline-open . 0)            ;; No indent for { in inline functions
             (block-open . 0)             ;; Same here for blocks
             (brace-list-open . 0)        ;; No indent for { in lists
             (brace-list-close . 0)       ;; No indent for } in lists
             (brace-entry-open . 0)))     ;; No indent for { in brace entries

     (add-hook 'csharp-mode-hook 'format-all-mode)
     (setq format-all-formatters
           '((csharp-mode . "clang-format")))
     )
  :bind (("C-c C-d" . 'omnisharp-run-code-action-refactoring)))

(defun open-external-file-explorer ()
  "Opens file explorer in the current directory"
  (interactive)
  (call-process-shell-command "dolphin . &" nil 0))
(global-set-key (kbd "<f3>") 'open-external-file-explorer)

(defun open-external-terminal ()
  "Opens external terminal in the current directory"
  (interactive)
  (call-process-shell-command "alacritty  &" nil 0))
(global-set-key (kbd "<f1>") 'open-external-terminal)
