config.org
*** Find file
#+begin_src emacs-lisp :tangle yes
(use-package! projectile
  :config
  ;; Bind s-S-o to find file in project using projectile (command+shift+o)
  ;; mac
  (map! :desc "Open Find file in the project"
        "s-O" #'projectile-find-file))

  ;; linux
  (bind-key* "C-S-o" 'projectile-find-file)

#+end_src

#+RESULTS:
: projectile-find-file

*** Find current file in directory
#+begin_src emacs-lisp :tangle yes
(use-package! neotree
  :config
  ;; Bind s-S-j to open NeoTree to the current file's location (command+shift+j)
  ;; mac
  (map! :desc "Open NeoTree at current file"
        "s-J" #'+neotree/find-this-file))


  ;; linux
  (bind-key* "C-S-j" '+neotree/find-this-file)
#+end_src

#+RESULTS:
: +neotree/find-this-file

*** Find references in project
#+begin_src emacs-lisp :tangle yes
(defun find-references-under-cursor ()
  "Find references of the word under the cursor using projectile-find-references"
  (interactive)
  (let (word (get-string-under-cursor))
    (if word
        (projectile-find-references word)
      (projectile-find-references)
      )
    )
  )

(defun get-string-under-cursor ()
  "Get the string (including underscores) under the cursor."
  (interactive)
  (bounds-of-thing-at-point 'symbol)
  )

;; mac
(map! :desc "Find references of the word under cursor in the project"
      "s-F" 'find-references-under-cursor)

;; linux
(bind-key* "C-S-f" 'find-references-under-cursor)
#+end_src

#+RESULTS:
: find-references-under-cursor

*** Find definition under cursor
#+begin_src emacs-lisp :tangle yes
(global-set-key [f12] 'xref-find-definitions)

;; mac
(map! :desc "Find definition under cursor"
      "s-<mouse-1>" 'xref-find-definitions)

;; linux
(map! :desc "Find definition under cursor"
      "S-s-<mouse-1>" 'xref-find-definitions)
#+end_src

#+RESULTS:

*** Open file vertically
#+begin_src emacs-lisp :tangle yes
(map! :desc "Split window vertically"
      "C-\\" 'evil-window-vsplit)
#+end_src

#+RESULTS:

*** Comment code
#+begin_src emacs-lisp :tangle yes
(map! :desc "Comment code in the file"
      "C-/" 'comment-line)
#+end_src

#+RESULTS:
*** Format whole buffer
#+begin_src emacs-lisp :tangle yes
;; TODO
(use-package format-all
  :ensure t
  :hook
  ((json-mode . format-all-mode)
   (typescript-mode . format-all-mode)
   (svelte-mode . format-all-mode)))

;; Mac
(map! :desc "Format region or buffer"
      "s-L" `+format/region-or-buffer)

;; linux
(bind-key* "C-S-l" '+format/region-or-buffer)
#+end_src

#+RESULTS:
: +format/region-or-buffer

*** Blame of one line
#+begin_src emacs-lisp :tangle yes
(setq! git-messenger:use-magit-popup t)
(map! :desc "Show git blame under the cursor"
      "s-B" 'git-messenger:popup-message)
#+end_src

#+RESULTS:

*** Ctrl-tab for buffer switching
#+begin_src emacs-lisp
;; seems to override any other existing commands
(bind-key* "C-<tab>" 'next-buffer)
(bind-key* "C-S-<tab>" 'previous-buffer)
;; for linux
(bind-key* "C-<iso-lefttab>" 'previous-buffer)
#+end_src

#+RESULTS:
: previous-buffer

** Org mode
*** Calendar settings
#+begin_src emacs-lisp :tangle yes
(setq european-calendar-style 't)
(setq calendar-week-start-day 1);; weeks start on monday
#+end_src

*** TODO modes
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)"
           "PROJ(p)"
           "LOOP(R)"
           "STRT(s)"
           "WAIT(w)"
           "LECTURE(l)"
           "ROUTINE(r)"
           "HOLD(h)"
           "IDEA(i)"
           "|"
           "DONE(d)"
           "KILL(k)")
          (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)")
          (sequence "|" "OKAY(o)" "YES(y)" "NO(n)")))
  (setq org-todo-keyword-faces
        '(("[-]" . +org-todo-active)
          ("STRT" . +org-todo-active)
          ("[?]" . +org-todo-onhold)
          ("WAIT" . +org-todo-onhold)
          ("HOLD" . +org-todo-onhold)
          ("PROJ" . +org-todo-project)
          ("LECTURE" . (:foreground "orange"))
          ("ROUTINE" . (:foreground "violet"))
          ("NO" . +org-todo-cancel)
          ("KILL" . +org-todo-cancel)))
  )
#+end_src

*** Org bullets
#+begin_src emacs-lisp :tangle yes
(require 'org-checklist)
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-bullets-bullet-list '("◉" "○"))
#+end_src
#+RESULTS:
| ◉ | ○ |

** Misc
#+begin_src emacs-lisp :tangle yes
(save-place-mode 1)
(yas-global-mode 1)

;; rainbow mode for braces
(add-hook 'c-mode-hook #'rainbow-mode)
;; scrolling in pdf file
(setq doc-view-continuous t)

#+end_src

#+RESULTS:
: t

** Tramp
#+begin_src emacs-lisp :tangle yes
(with-eval-after-load 'tramp
  (eval-when-compile (require 'tramp))
  (add-to-list 'tramp-remote-path 'tramp-own-remote-path)
  (setq tramp-completion-use-auth-sources nil)
  ;; (setq rustic-format-on-save nil)
  )

(after! tramp-mode
  (setq projectile-mode-line "Projectile")
  ;; (setq rustic-format-on-save nil)
  (setq tramp-completion-method 'fuzzy)
  (setq completion-ignore-case t)
  (setq tramp-default-remote-shell "/bin/bash")
  )
#+end_src

#+RESULTS:

** Eshell
#+begin_src emacs-lisp :tangle yes
(after! eshell
    (setq eshell-banner-message
        (format "%s %s\n"
            (propertize (format " %s " (string-trim (buffer-name)))
                'face 'doom-modeline-panel)
            (propertize
                (current-time-string)
                'face 'font-lock-keyword-face
            )
         )
    )
)
;; (defun eshell_toggle  (arg &optional command)
;;   "Toggle eshell popup window."
;;   (interactive "P")
;;   (let ((eshell-buffer
;;          (get-buffer-create
;;           (format "*doom:eshell-popup:%s*"
;;                   (if (bound-and-true-p persp-mode)
;;                       (safe-persp-name (get-current-persp))
;;                     "main"))))
;;         confirm-kill-processes
;;         current-prefix-arg)
;;     (when arg
;;       (when-let (win (get-buffer-window eshell-buffer))
;;         (delete-window win))
;;       (when (buffer-live-p eshell-buffer)
;;         (with-current-buffer eshell-buffer
;;           (fundamental-mode)
;;           (erase-buffer))))
;;     (if-let (win (get-buffer-window eshell-buffer))
;;         (let (confirm-kill-processes)
;;           (delete-window win)
;;           (ignore-errors (kill-buffer eshell-buffer)))
;;       (with-current-buffer eshell-buffer
;;         (doom-mark-buffer-as-real-h)
;;         (if (eq major-mode 'eshell-mode)
;;             (run-hooks 'eshell-mode-hook)
;;           (eshell-mode))
;;         (when command
;;           (+eshell-run-command command eshell-buffer)))
;;       (pop-to-buffer eshell-buffer))))

;; (defun custom-eshell-toggle ()
;;   "Toggle Eshell: Focus it if it is open but not focused, or open it if it doesn't exist, or close it if it is focused."
;;   (interactive)
;;       (let ((eshell-buffer (cl-find-if (lambda (buf)
;;                                          (with-current-buffer buf
;;                                            (eq major-mode 'eshell-mode)))
;;                                        (buffer-list))))
;;         (cond
;;          ;; If eshell is open and focused, close it
;;          ((and eshell-buffer (eq (current-buffer) eshell-buffer))
;;           ((eshell_toggle ())))

;;          ;; If eshell is open but not focused, switch to it
;;          ((and eshell-buffer (not (eq (current-buffer) eshell-buffer)))
;;           (switch-to-buffer eshell-buffer))

;;          ;; If eshell is not open, create a new eshell buffer
;;          ((eshell_toggle ())))))

;; (map! :n "SPC o e" nil)

;; (map! :desc "custom toggle eshell"
      ;; "SPC o z" 'eshell_toggle)
#+end_src

#+RESULTS:
: custom-eshell-toggle

