config.el

(setq dap-auto-configure-features '(sessions locals breakpoints))
(defun my/delete-buffers-by-mode (mode)
  "Delete all buffers with the given major mode."
  (dolist (buf (buffer-list))
    (with-current-buffer buf
      (when (eq major-mode mode)
        (kill-buffer buf)))))

(defun my/delete-dap-buffers-on-termination (&rest _args)
  "Delete buffers with dap-mode when dap session terminates."
  (my/delete-buffers-by-mode 'special-mode))

(add-hook 'dap-terminated-hook 'my/delete-dap-buffers-on-termination)
(add-hook 'dap-terminated-hook #'doom-modeline-update-debug-dap)


(defvar my-eshell-was-active nil
  "Flag to remember if any Eshell buffer was active before starting DAP.")

(defun my/dap-start-hook ()
  "Hook to toggle Eshell off when starting DAP by checking all existing buffers."
  (let ((eshell-buffer (cl-find-if (lambda (buf)
                                    (with-current-buffer buf
                                      (eq major-mode 'eshell-mode)))
                                  (buffer-list))))
    (when eshell-buffer
      (setq my-eshell-was-active t)
      (eshell/toggle))))

(defun my/dap-end-hook ()
  "Hook to toggle Eshell back on if it was active before DAP."
  (when my-eshell-was-active
    (eshell/toggle)
    (setq my-eshell-was-active nil)))

;; Hook into DAP mode
(add-hook 'dap-session-started-hook 'my/dap-start-hook)
(add-hook 'dap-session-terminated-hook 'my/dap-end-hook)

(after! dap-mode
  (require 'dap-cpptools)

  (add-hook 'rustic-mode-hook (lambda ()
                                (dap-register-debug-template "Rust LLDB Debug Configuration"
	                                                        (list :type "cppdbg"
	                                                           :request "launch"
	                                                           :name "Rust::Run"
	                                                           :MIMode "lldb"
                                                                   :targetarchitecture "arm"
	                                                           :gdbpath "rust-lldb"
	                                                           ;; :program (concat (projectile-project-root) "target/debug/" (projectile-project-name)) ;; Requires that the rust project is a project in projectile
	                                                           ;; :cwd (projectile-project-root)
                                                                   :program "${workspaceFolder}/target/debug/${workspaceFolderBasename}"
                                                                   :cwd "${workspaceFolder}"
	                                                           :environment []
                                                                   ))))

  (setq lsp-rust-analyzer-debug-lens-extra-dap-args
        `(:MIMode "lldb"
          ;; :miDebuggerPath "rust-gdb"
          ;; :miDebuggerPath "rust-lldb"
          :stopAtEntry t
          :externalConsole
          :json-false))

  (with-eval-after-load 'dap-mode
    (setq dap-default-terminal-kind "integrated")
    (dap-auto-configure-mode +1))

  (map! :map dap-mode-map
        :leader
        :prefix ("d" . "dap")
        ;; basics
        :desc "dap next"          "n" #'dap-next
        :desc "dap step in"       "i" #'dap-step-in
        :desc "dap step out"      "o" #'dap-step-out
        :desc "dap continue"      "c" #'dap-continue
        :desc "dap hydra"         "h" #'dap-hydra
        :desc "dap debug restart" "r" #'dap-debug-restart
        :desc "dap debug"         "s" #'dap-debug
        :desc "dap disconnect"    "q" #'dap-disconnect

        ;; debug
        :prefix ("dd" . "Debug")
        :desc "dap debug recent"  "r" #'dap-debug-recent
        :desc "dap debug last"    "l" #'dap-debug-last

        ;; eval
        :prefix ("de" . "Eval")
        :desc "eval"                "e" #'dap-eval
        :desc "eval region"         "r" #'dap-eval-region
        :desc "eval thing at point" "s" #'dap-eval-thing-at-point
        :desc "add expression"      "a" #'dap-ui-expressions-add
        :desc "remove expression"   "d" #'dap-ui-expressions-remove

        :prefix ("db" . "Breakpoint")
        :desc "dap breakpoint toggle"      "b" #'dap-breakpoint-toggle
        :desc "dap breakpoint condition"   "c" #'dap-breakpoint-condition
        :desc "dap breakpoint hit count"   "h" #'dap-breakpoint-hit-condition
        :desc "dap breakpoint log message" "l" #'dap-breakpoint-log-message))

(defun open-buffer-in-new-frame-and-close-original ()
  "Move the current buffer to a new frame and close the window in the original frame."
  (interactive)
  (let ((buffer (current-buffer)))
    (select-frame (make-frame-command)) ; Create a new frame and switch to it
    (switch-to-buffer buffer)           ; Switch to the current buffer
    (delete-window)))                   ; Close the original window in the main frame

(defun move-buffer-to-existing-frame ()
  "Move the current buffer to another existing frame if one exists."
  (interactive)
  (let ((buffer (current-buffer))
        (frames (delq (selected-frame) (frame-list)))) ; All frames except the current one
    (if frames
        (progn
          (select-frame-set-input-focus (car frames)) ; Switch to the first other frame
          (switch-to-buffer buffer)
          (delete-window)) ; Close the window in the original frame
      (message "No other frames exist."))))

(with-eval-after-load 'rust-mode
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup)
  (add-hook 'flycheck-mode-hook #'flycheck-inline-mode)
  (add-hook 'lsp-diagnostics-mode-hook #'flycheck-inline-mode)
  (setq-default flycheck-rust-checker 'rustic-clippy)
  )

(setq minimap-window-location 'right)
(custom-set-faces
 '(minimap-active-region-background
   ((t (:background "#363646")))))

(setq ein:output-area-inlined-images t)
(setq ein:markdown-enable-math t)

(custom-set-faces
 '(ein:basecell-input-area-face
   ((t (:background "#363646"))))
 )

(map! :map ein-mode-map
      :leader
      :prefix ("j" . "ein (jupyter)")
      ;; basics
      :desc "ein execute above"          "a" #'ein:worksheet-execute-all-cells-above
      :desc "ein execute below"          "b" #'ein:worksheet-execute-all-cells-below
      :desc "run ein server"             "r" #'ein:run
      :desc "ein rename notebook"        "R" #'ein:notebook-rename-command-km
      :desc "save jupyter"               "s" #'ein:notebook-save-notebook-command-km
      :desc "stop ein server"            "q" #'ein:stop
      :desc "ein execute all"            "x" #'ein:worksheet-execute-all-cells

      ;; cell
      :prefix ("jc" . "Debug")
      :desc "ein new cell above"         "a" #'ein:worksheet-insert-cell-above
      :desc "ein new cell below"         "b" #'ein:worksheet-insert-cell-below
      :desc "ein change cell type"       "c" #'ein:worksheet-change-cell-type
      :desc "ein delete current cell"    "d" #'ein:worksheet-delete-cell
      )

(add-hook! 'ein:ipynb-mode-hook
  ;; By adding it to this hook, we can be sure that the server
  ;; won't be started until the buffer is visible (prevents a
  ;; cascade of new processes when opening multiple *.ipynb files
  ;; all at once.
  (add-hook 'doom-switch-buffer-hook #'ein:process-open-notebook nil 'local))
