config.org
** Markdown
#+begin_src emacs-lisp tangle :yes
 (defvar nb/current-line '(0 . 0)
   "(start . end) of current line in current buffer")
 (make-variable-buffer-local 'nb/current-line)

 (defun nb/unhide-current-line (limit)
   "Font-lock function"
   (let ((start (max (point) (car nb/current-line)))
         (end (min limit (cdr nb/current-line))))
     (when (< start end)
       (remove-text-properties start end
                       '(invisible t display "" composition ""))
       (goto-char limit)
       t)))

 (defun nb/refontify-on-linemove ()
   "Post-command-hook"
   (let* ((start (line-beginning-position))
          (end (line-beginning-position 2))
          (needs-update (not (equal start (car nb/current-line)))))
     (setq nb/current-line (cons start end))
     (when needs-update
       (font-lock-fontify-block 3))))

 (defun nb/markdown-unhighlight ()
   "Enable markdown concealling"
   (interactive)
   (markdown-toggle-markup-hiding 'toggle)
   (font-lock-add-keywords nil '((nb/unhide-current-line)) t)
   (add-hook 'post-command-hook #'nb/refontify-on-linemove nil t))

 (add-hook 'markdown-mode-hook #'nb/markdown-unhighlight)
#+end_src

#+RESULTS:
| doom--setq-fill-nobreak-predicate-for-markdown-mode-h | (lambda nil (setq markdown-enable-math t) (setq font-latex-match-script nil) (preview-mode 1)) | nb/markdown-unhighlight | +lookup--init-markdown-mode-handlers-h | evil-markdown-mode | doom--enable-+javascript-npm-mode-in-markdown-mode-h | +corfu-add-cape-elisp-block-h |

** Additional info
- Here are some additional functions/macros that could help you configure Doom:
  + `load!' for loading external *.el files relative to this one
  + `use-package!' for configuring packages
  + `after!' for running code after a package has loaded
  + `add-load-path!' for adding directories to the `load-path', relative to this file. Emacs searches the `load-path' when you load packages with `require' or `use-package'.
  + `map!' for binding new keys
- To get information about any of these functions/macros, move the cursor over the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
- This will open documentation for it, including demos of how they are used.
- You can also try 'gd' (or 'C-c c d') to jump to their definition and see how they are implement
(add-to-list 'tramp-remote-path 'tramp-own-remote-path)
** LaTex
#+begin_src emacs-lisp :tangle yes
(setenv "PATH" (concat ":/Library/TeX/texbin/" (getenv "PATH")))
(add-to-list 'exec-path "/Library/TeX/texbin/")

(add-hook 'org-mode-hook 'org-fragtog-mode)

(after! org
  (map! :map org-mode-map
        :localleader
        :desc "Toggle centered-window-mode"
        "w" #'centered-window-mode))

(setq org-format-latex-options
              (plist-put org-format-latex-options :scale 1.7))

(setq org-highlight-latex-and-related '(latex script entities))


#+end_src

#+RESULTS:
| latex | script | entities |
